app/Controllers/Siswa/Ujian.php

    public function index() {

        $siswa = $this->siswaModel->find($this->session->get("id"));
        // dd($this->session->get("id"));

        // dd($siswa);

        $db      = \Config\Database::connect();
        $builder = $db->table('ujian');
        $builder->select("ujian.*");
        $builder->select("dataguru.nama as namaguru");
        $builder->select("datamapel.nama_mapel as mapel");
        $builder->select("dataruangankelas.nama_ruangan as kelas");
        $builder->join("dataruangankelas", "dataruangankelas.id = ujian.kelas", "left");
        $builder->join("dataguru", "dataguru.id = ujian.guru", "left");
        $builder->join("datamapel", "datamapel.id = ujian.mapel", "left");
        $builder->where("ujian.kelas", $siswa["ruangan"]);
        $builder->where("ujian.status", "Aktif");
        $query = $builder->get();
---
SELECT `ujian`.*, `dataguru`.`nama` as `namaguru`, `datamapel`.`nama_mapel` as `mapel`, `dataruangankelas`.`nama_ruangan` as `kelas`
FROM `ujian`
LEFT JOIN `dataruangankelas` ON `dataruangankelas`.`id` = `ujian`.`kelas`
LEFT JOIN `dataguru` ON `dataguru`.`id` = `ujian`.`guru`
LEFT JOIN `datamapel` ON `datamapel`.`id` = `ujian`.`mapel`
WHERE `ujian`.`kelas` = '11'
AND `ujian`.`status` = 'Aktif'

    public function kerjaujian($id) {
        $siswa = $this->siswaModel->find($this->session->get("id"));

        $db      = \Config\Database::connect();
        $builder = $db->table('ujian');
        $builder->select("ujian.*");
        $builder->select("dataguru.nama as namaguru");
        $builder->select("datamapel.nama_mapel as mapel");
        $builder->select("dataruangankelas.nama_ruangan as kelas");
        $builder->join("dataruangankelas", "dataruangankelas.id = ujian.kelas", "left");
        $builder->join("dataguru", "dataguru.id = ujian.guru", "left");
        $builder->join("datamapel", "datamapel.id = ujian.mapel", "left");
        $builder->where("ujian.kelas", $siswa["ruangan"]);
        $builder->where("ujian.id", $id);


        $query = $builder->get();
---
SELECT `ujian`.*, `dataguru`.`nama` as `namaguru`, `datamapel`.`nama_mapel` as `mapel`, `dataruangankelas`.`nama_ruangan` as `kelas`
FROM `ujian`
LEFT JOIN `dataruangankelas` ON `dataruangankelas`.`id` = `ujian`.`kelas`
LEFT JOIN `dataguru` ON `dataguru`.`id` = `ujian`.`guru`
LEFT JOIN `datamapel` ON `datamapel`.`id` = `ujian`.`mapel`
WHERE `ujian`.`kelas` = '11'
AND `ujian`.`id` = '11'