app/Helpers/Guru/Kelas_helper.php

SELECT DISTINCT `dataruangankelas`.`nama_ruangan`, `dataruangankelas`.`id`
FROM `datajadwal`
JOIN `dataguru` ON `datajadwal`.`guru` = `dataguru`.`id`
JOIN `dataruangankelas` ON `dataruangankelas`.`id` = `datajadwal`.`kelas`
WHERE `datajadwal`.`guru` = '34'
---
function findKelasAjar($idguru) {
    $db =  \Config\Database::connect();
    $builder = $db->table("datajadwal");
    $builder->distinct("kelas");
    $builder->select("dataruangankelas.nama_ruangan");
    $builder->select("dataruangankelas.id");
    // $builder->select("dataruangankelas.*");
    $builder->join("dataguru", "datajadwal.guru = dataguru.id");
    $builder->join("dataruangankelas", "dataruangankelas.id = datajadwal.kelas");
    $builder->where("datajadwal.guru", $idguru);
    return $builder->get()->getResultArray();

SELECT DISTINCT `datamapel`.`nama_mapel`
FROM `datajadwal`
JOIN `datamapel` ON `datajadwal`.`mapel` = `datamapel`.`id`
WHERE `datajadwal`.`guru` = '34'
AND `datajadwal`.`kelas` = '11'
---
function findMapelAjar($id, $kls) {
    $db      =  \Config\Database::connect();
    $builder = $db->table("datajadwal");
    $builder->select("datamapel.nama_mapel");
    $builder->join("datamapel", "datajadwal.mapel = datamapel.id");
    $builder->where("datajadwal.guru", $id);
    $builder->where("datajadwal.kelas", $kls);
    $builder->distinct("mapel");
    return $builder->get()->getResultArray();

SELECT `dataruangankelas`.`id`, `dataruangankelas`.`nama_ruangan`
FROM `dataguru`
JOIN `dataruangankelas` ON `dataguru`.`status` = `dataruangankelas`.`id`
WHERE `dataguru`.`id` = '34'
---
function findKelasWali($idguru) {
    $db      =  \Config\Database::connect();
    $builder = $db->table("dataguru");
    $builder->select("dataruangankelas.id");
    $builder->select("dataruangankelas.nama_ruangan");
    $builder->join("dataruangankelas", "dataguru.status = dataruangankelas.id");
    $builder->where("dataguru.id", $idguru);
    return $builder->get()->getResultArray();

SELECT `dataruangankelas`.`id`, `dataruangankelas`.`nama_ruangan`
FROM `datasiswa`
JOIN `dataruangankelas` ON `datasiswa`.`ruangan` = `dataruangankelas`.`id`
WHERE `datasiswa`.`id` = '23'
---
function namaRuanganKelas($idsiswa) {
    $db      =  \Config\Database::connect();
    $builder = $db->table("datasiswa");
    $builder->select("dataruangankelas.id");
    $builder->select("dataruangankelas.nama_ruangan");
    $builder->join("dataruangankelas", "datasiswa.ruangan = dataruangankelas.id");
    $builder->where("datasiswa.id", $idsiswa);
    return $builder->get()->getFirstRow("array");