app/Helpers/Guru/Nilai_helper.php

SELECT `hasiltugas`.*, `tugas`.*
FROM `hasiltugas`
LEFT JOIN `tugas` ON `tugas`.`id` = `hasiltugas`.`tugas`
WHERE `hasiltugas`.`siswa` = '23'
AND `tugas`.`mapel` = '2'
AND `tugas`.`kelas` = '11'
---
function getNilaiTugas($idsiswa, $idkelas, $idmapel) {
    $db =  \Config\Database::connect();
    $builder = $db->table("hasiltugas");
    $builder->select("hasiltugas.*");
    $builder->select("tugas.*");
    $builder->join("tugas", "tugas.id = hasiltugas.tugas", "left");

    $builder->where("hasiltugas.siswa", $idsiswa);
    $builder->where("tugas.mapel", $idmapel);
    $builder->where("tugas.kelas", $idkelas);
    return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `hasiltugas`
JOIN `tugas` ON `tugas`.`id` = `hasiltugas`.`tugas`
WHERE `tugas`.`mapel` = '2'
AND `tugas`.`kelas` = '11'
---
function getJumlahTugas($idkelas, $idmapel) {
    $db =  \Config\Database::connect();
    $builder = $db->table("hasiltugas");

    $builder->select("hasiltugas.*");
    $builder->join("tugas", "tugas.id = hasiltugas.tugas");
    $builder->where("tugas.mapel", $idmapel);
    $builder->where("tugas.kelas", $idkelas);
    return $builder->countAllResults();

SELECT `hasilquiz`.*, `quiz`.*
FROM `hasilquiz`
LEFT JOIN `quiz` ON `quiz`.`id` = `hasilquiz`.`quiz`
WHERE `hasilquiz`.`siswa` = '23'
AND `quiz`.`mapel` = '2'
AND `quiz`.`kelas` = '11'
---
function getNilaiQuiz($idsiswa, $idkelas, $idmapel) {
    $db =  \Config\Database::connect();
    $builder = $db->table("hasilquiz");
    $builder->select("hasilquiz.*");
    $builder->select("quiz.*");
    $builder->join("quiz", "quiz.id = hasilquiz.quiz", "left");

    $builder->where("hasilquiz.siswa", $idsiswa);
    $builder->where("quiz.mapel", $idmapel);
    $builder->where("quiz.kelas", $idkelas);
    return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `hasilquiz`
JOIN `quiz` ON `quiz`.`id` = `hasilquiz`.`quiz`
WHERE `quiz`.`mapel` = '2'
AND `quiz`.`kelas` = '11'
---
function getJumlahQuiz($idkelas, $idmapel) {
    $db =  \Config\Database::connect();
    $builder = $db->table("hasilquiz");

    $builder->select("hasilquiz.*");
    $builder->join("quiz", "quiz.id = hasilquiz.quiz");
    $builder->where("quiz.mapel", $idmapel);
    $builder->where("quiz.kelas", $idkelas);
    return $builder->countAllResults();

SELECT `hasilujian`.*, `ujian`.*
FROM `hasilujian`
LEFT JOIN `ujian` ON `ujian`.`id` = `hasilujian`.`ujian`
WHERE `hasilujian`.`siswa` = '23'
AND `ujian`.`mapel` = '2'
AND `ujian`.`kelas` = '11'
---
function getNilaiUjian($idsiswa, $idkelas, $idmapel) {
    $db =  \Config\Database::connect();
    $builder = $db->table("hasilujian");
    $builder->select("hasilujian.*");
    $builder->select("ujian.*");
    $builder->join("ujian", "ujian.id = hasilujian.ujian", "left");

    $builder->where("hasilujian.siswa", $idsiswa);
    $builder->where("ujian.mapel", $idmapel);
    $builder->where("ujian.kelas", $idkelas);
    return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `hasilujian`
JOIN `ujian` ON `ujian`.`id` = `hasilujian`.`ujian`
WHERE `ujian`.`mapel` = '2'
AND `ujian`.`kelas` = '11'
---
function getJumlahUjian($idkelas, $idmapel) {
    $db =  \Config\Database::connect();
    $builder = $db->table("hasilujian");

    $builder->select("hasilujian.*");
    $builder->join("ujian", "ujian.id = hasilujian.ujian");
    $builder->where("ujian.mapel", $idmapel);
    $builder->where("ujian.kelas", $idkelas);
    return $builder->countAllResults();