app/Helpers/Guru/Walikelas_helper.php

function getMapelAllKelas($kelas) {
    $db =  \Config\Database::connect();
    $builder = $db->table("datajadwal");
    $builder->select("datajadwal.*");
    $builder->select("datamapel.nama_mapel");
    $builder->select("dataguru.nama");
    $builder->join("dataguru", "dataguru.id = datajadwal.guru");
    $builder->join("datamapel", "datamapel.id = datajadwal.mapel");
    $builder->distinct("mapel");

    $builder->where("datajadwal.kelas", $kelas);
    return $builder->get()->getResultArray();
---
SELECT DISTINCT `datajadwal`.*, `datamapel`.`nama_mapel`, `dataguru`.`nama`
FROM `datajadwal`
JOIN `dataguru` ON `dataguru`.`id` = `datajadwal`.`guru`
JOIN `datamapel` ON `datamapel`.`id` = `datajadwal`.`mapel`
WHERE `datajadwal`.`kelas` = '11'

function getAllSiswaKelas($kelas) {
    $db =  \Config\Database::connect();
    $builder = $db->table("datasiswa");
    $builder->select("datasiswa.*");

    // $builder->select("hasiltugas.nilai");
    // $builder->select("hasilquiz.nilai");
    // $builder->select("hasilujian.nilai");
    $builder->where("datasiswa.ruangan", $kelas);



    // $builder->select("dataguru.nama");
    // $builder->join("dataguru", "dataguru.id = datajadwal.guru");
    // $builder->join("datamapel", "datamapel.id = datajadwal.mapel");
    // $builder->distinct("mapel");

    // $builder->where("datajadwal.kelas", $kelas);


    // $builder->where("datajadwal.kelas", $kelas);
    return $builder->get()->getResultArray();
---
SELECT `datasiswa`.*
FROM `datasiswa`
WHERE `datasiswa`.`ruangan` = '11'

function getKkm($idmapel) {
    $db =  \Config\Database::connect();
    $builder = $db->table("datamapel");
    $builder->select("datamapel.*");
    // $builder->join("datamapel", "datamapel.id = datajadwal.mapel");
    $builder->distinct("mapel");
    $builder->where("datamapel.id", $idmapel);

    return $builder->get()->getFirstRow("array");
---
SELECT DISTINCT `datamapel`.*
FROM `datamapel`
WHERE `datamapel`.`id` = '2'