app/Controllers/Guru/Kelas.php

    public function detail($kls) {
        $this->id = $this->session->get("id");
        $mapel = findMapelAjar($this->id, $kls);

        $kelas = $this->dataKelas->find($kls);

        // dd($kelas);

        $data = [
            "kelas" => $kelas,
            'mapel' => $mapel,
            'title' => "Data Kelas " . $kelas["nama_ruangan"],
            'siswa' => $this->dataSiswa->where("ruangan", $kls)->findAll()
---
SELECT *
FROM `datasiswa`
WHERE `ruangan` = '11'