app/Controllers/Guru/Nilai.php

SELECT DISTINCT `dataruangankelas`.`nama_ruangan`, `dataruangankelas`.`id`
FROM `datajadwal`
JOIN `dataguru` ON `datajadwal`.`guru` = `dataguru`.`id`
JOIN `dataruangankelas` ON `dataruangankelas`.`id` = `datajadwal`.`kelas`
WHERE `datajadwal`.`guru` = '33'
SELECT DISTINCT `datamapel`.*
FROM `datajadwal`
JOIN `dataguru` ON `datajadwal`.`guru` = `dataguru`.`id`
JOIN `datamapel` ON `datajadwal`.`mapel` = `datamapel`.`id`
WHERE `datajadwal`.`guru` = '33'
---
    public function index() {
        $id = $this->session->get("id");


        // Data kelas
        $db =  \Config\Database::connect();
        $builder = $db->table("datajadwal");
        $builder->distinct("kelas");
        $builder->select("dataruangankelas.nama_ruangan");
        $builder->select("dataruangankelas.id");
        $builder->join("dataguru", "datajadwal.guru = dataguru.id");
        $builder->join("dataruangankelas", "dataruangankelas.id = datajadwal.kelas");
        $builder->where("datajadwal.guru", $id);
        $kelas =   $builder->get()->getResultArray();


        // data matapelajaran
        $db =  \Config\Database::connect();
        $builder = $db->table("datajadwal");

        $builder->distinct("mapel");
        $builder->select("datamapel.*");
        $builder->join("dataguru", "datajadwal.guru = dataguru.id");
        $builder->join("datamapel", "datajadwal.mapel = datamapel.id");
        $builder->where("datajadwal.guru", $id);
        $mapel =   $builder->get()->getResultArray();

SELECT *
FROM `nilai`
---

        $data = [
            "title" => "Nilai Siswa",
            "nilai" => $this->nilaiModel->findAll(),

SELECT DISTINCT `dataruangankelas`.`nama_ruangan`, `dataruangankelas`.`id`
FROM `datajadwal`
JOIN `dataguru` ON `datajadwal`.`guru` = `dataguru`.`id`
JOIN `dataruangankelas` ON `dataruangankelas`.`id` = `datajadwal`.`kelas`
WHERE `datajadwal`.`guru` = '33'
SELECT DISTINCT `datamapel`.*
FROM `datajadwal`
JOIN `dataguru` ON `datajadwal`.`guru` = `dataguru`.`id`
JOIN `datamapel` ON `datajadwal`.`mapel` = `datamapel`.`id`
WHERE `datajadwal`.`guru` = '33'
---
    public function getdata() {
        $id = $this->session->get("id");


        // Data kelas
        $db =  \Config\Database::connect();
        $builder = $db->table("datajadwal");
        $builder->distinct("kelas");
        $builder->select("dataruangankelas.nama_ruangan");
        $builder->select("dataruangankelas.id");
        $builder->join("dataguru", "datajadwal.guru = dataguru.id");
        $builder->join("dataruangankelas", "dataruangankelas.id = datajadwal.kelas");
        $builder->where("datajadwal.guru", $id);
        $dtkelas =   $builder->get()->getResultArray();


        // data matapelajaran
        $db =  \Config\Database::connect();
        $builder = $db->table("datajadwal");
        $builder->distinct("mapel");
        $builder->select("datamapel.*");
        $builder->join("dataguru", "datajadwal.guru = dataguru.id");
        $builder->join("datamapel", "datajadwal.mapel = datamapel.id");
        $builder->where("datajadwal.guru", $id);
        $dtmapel =   $builder->get()->getResultArray();