app/Controllers/Guru/Raportsiswa.php

    public function detail($idsiswa) {
        helper("Guru/Kelas");
        helper("Guru/Walikelas");

        $siswa = $this->dataSiswa->find($idsiswa);
---
SELECT *
FROM `datasiswa`
WHERE `datasiswa`.`id` = '23'