app/Controllers/Guru/Tugas.php

SELECT *
FROM `tugas`
WHERE `guru` = '34'
SELECT *
FROM `tugas`
WHERE `guru` = '34'
ORDER BY `status` ASC
SELECT *
FROM `dataruangankelas`
SELECT *
FROM `datamapel`
---
    public function index() {
        $id = $this->session->get("id");
        $this->kelasModel = new AdminDataRuangankelas();
        $this->mapelModel = new DataMapelModel();
        $dataTugas = $this->tugasModel->where(["guru" => $id])->findAll();

        $data = [
            'title' => "Tugas",
            "tugas" => $this->tugasModel->where(["guru" => $id])->orderBy("status", "asc")->findAll(),
            "ruangan" => $this->kelasModel->findAll(),
            "mapel" => $this->mapelModel->findAll()