app/Controllers/Guru/Ujian.php

    public function index() {
        $id = $this->session->get("id");

        $this->kelasModel = new AdminDataRuangankelas();
        $this->mapelModel = new DataMapelModel();
        $dataUjian = $this->ujianModel->where(["guru" => $id])->findAll();

        $data = [
            'title' => "Ujian",
            "ujian" => $this->ujianModel->where(["guru" => $id])->orderBy("status", "asc")->findAll(),
            "ruangan" => $this->kelasModel->findAll(),
            "mapel" => $this->mapelModel->findAll()
---
SELECT *
FROM `ujian`
WHERE `guru` = '33'
SELECT *
FROM `ujian`
WHERE `guru` = '33'
ORDER BY `status` ASC
SELECT *
FROM `dataruangankelas`
SELECT *
FROM `datamapel`

    public function detail($id) {
        $db = \Config\Database::connect();
        $builder = $db->table("hasilujian");
        $builder->select("datasiswa.nama");
        $builder->select("hasilujian.*");
        $builder->join("datasiswa", "datasiswa.id = hasilujian.siswa", "left");
        $builder->where("hasilujian.ujian", $id);

        $query = $builder->get();
---
SELECT `datasiswa`.`nama`, `hasilujian`.*
FROM `hasilujian`
LEFT JOIN `datasiswa` ON `datasiswa`.`id` = `hasilujian`.`siswa`
WHERE `hasilujian`.`ujian` = '11'